
-- 自动选中的 NPC 对话选项
local GossipOptions = {
    -- 职业大厅
    "我是来寻求议会的智慧的。",
    "大法师瓦格斯，",
    "<将你的徽记放在桌子上。>",
    "<隐蔽地出示你的徽记。>",
    "我想要一头飞往神射手营地的鹰。",

    -- 世界任务
    "我给你带来了一些魔力酒",
    "我准备好了。",
    "呃，什么？",
    "好的。",
    "当然，我想试试。",
    "我需要一把宝箱钥匙。",
    "我准备好突袭赫达沙尔了。",
    "我准备好关闭能量源了。",
    "让我看看他们的故事吧。",
    "是的，我已经准备好帮忙酿造魔力酒了。",
    "我会把你的魔力酒分给有需要的人。",

    "把我带到黑鸦堡垒顶部。",
    "把我送到平台上。",
    "立刻送我去营地！",

    -- 副本：暗夜要塞
    "传送到暗夜之塔。",

    -- 宠物对战：开战
    "我想和你进行宠物对战",
    "你以为你能在宠物战斗中胜过我",
    "又有人来挑战了",
    "让我们来大战一场吧",
    "我们动手吧",
    "我们来战斗吧",

    -- 暗月马戏团
    "把我传送回大炮那里。",

    -- 宠物对战：治疗
    "我要治疗和复活我的战斗宠物。",

    -- 布林顿4000
    "我们开始吧！",

    -- 黑翼之巢
    "我做不到，瓦拉斯塔兹！",
    "瓦拉斯塔兹，不！！！",
    "我从不犯错。",
    "你已经失去理智了，奈法里奥斯。",
    "请继续。",

    -- 卡拉赞
    "我不是个演员。",
    "好吧，那么我试试看。",
    "喔，奶奶，你的耳朵怎么这么尖？",
    "喔，奶奶，你的眼睛怎么这么大？",
    "喔，奶奶，你的衣服怎么这么紫？",
    "兽人步兵",
    "控制黑手酋长",
    "控制兽人步兵",
    "控制兽人术士",
    "控制兽人通灵师",
    "控制被召唤的恶魔",
    "人类步兵",
    "控制莱恩国王",
    "控制人类步兵",
    "控制人类祭司",
    "控制人类召唤师",
    "控制被召唤的水元素",

    -- 海加尔山
    "再会，普罗德摩尔女士。",
    "我与你并肩作战，萨尔。",
    "我们无所畏惧。",
    "再会，萨尔。",

    -- 黑暗神殿
    "我准备好了，阿卡玛。",
    "我与你同在，阿卡玛。",
    "我们已经作好面对伊利丹的准备了。",

    -- 奥杜尔
    "激活辅助防御系统。",
    "我们准备好了。发动攻击吧！",
    "我们这就来帮忙！",

    -- 银色比武场
    "我完成了十字军的试炼。",
    "是的，我们已经准备好了迎接即将到来的挑战。",
    "开始第一场挑战吧！",
    "有什么新的挑战正等待着我们？",
    "我们已经准备好了迎接下一个挑战。",
    "当然！",
    "发信号吧！我们已经准备好了！",
    "很困难吗？",
    "瓦格里？我们已经准备好和他们作战了。",
    "感谢你的赞扬，演武场统领。",
    "这真奇怪……",

    -- 冰冠堡垒
    "我们准备好了，大王。巫妖王必须死！",
    "Lok'tar ogar！我们准备好了！兽人兄弟们，冲啊！",
    "我们准备好了，大领主。让我们为艾泽拉斯的命运而战！",

    -- 黑翼血环
    "<把我的手放在宝珠上。>",

    -- 时光之穴
    "请带我去主人的巢穴。",

    -- 巨龙之魂
    "我们成功了，卡雷苟斯。",
    "你们可以开始仪式了，我们会保护你们的。",
    "我们联盟时刻准备着。",
    "我们部落时刻准备着。",
    "让我们再靠近点！",
    "为了部落！",
    "为了正义与荣耀！",
    "我们击败了灭世者！",
    "难以置信！他不可能还活着！",

    -- 魔古山宝库
    "你还在等什么呢？",
    "快去打开这个东西。",
}

local Gossip = CreateFrame("Frame") do
    Gossip:SetScript("OnEvent", function(self, event, ...) self[event](self, event, ...) end)
    Gossip:RegisterEvent("GOSSIP_CONFIRM")
    Gossip:RegisterEvent("GOSSIP_SHOW")
end

function Gossip:GOSSIP_SHOW(event)
    if IsModifierKeyDown() then return end

    local title
    for i=1, select("#", GetGossipOptions()), 2 do
        title = select(i, GetGossipOptions())
        for j=1, #GossipOptions do
            if string.sub(title, 1, string.len(GossipOptions[j])) == GossipOptions[j] then
                SelectGossipOption((i+1)/2)
                return
            end
        end
    end
end

function Gossip:GOSSIP_CONFIRM(event)
    StaticPopup1Button1:Click(LeftButton, down)
end

